using System;
using System.Linq;
using System.Web.UI;

namespace WebApplication2
{
    public partial class WebForm1 : Page
    {
        private const string Questions2 = @"========================
Л3С5
Какво е характерно за Block Data Decomposition?
A.	Масивът се разделя на р непрекъснати блока с приблизително еднакъв размер
B.	Масивът не се разделя на никакви части
C.	Масивът се разделя на две части като едната винаги е по-голяма от другата
D.	Нито едно от посочените
Answer: A

========================
Л3С5
Какво е характерно за Block Data Decomposition?
A.	Разпределянето на блоковете данни между процесите трябва да осигурява добър баланс на изчислителният товар
B.	Масивът не се разделя на блокове
C.	Масивът се разделя на два блока като единият винаги е по-голям от другия
D.	Нито едно от посочените
Answer: A

========================
Л3С5
Какво е характерно за Block Data Decomposition?
A.	Всеки процес обработва [n/p] или [n/p] елемента
B.	Всеки процес обработва по един елемент в даден момент
C.	Всеки процес обработва данните еднократно
D.	Нито едно от посочените
Answer: A

========================
Л3С6
В кой от редовете е изписан правилно макроса BLOCK_LOW за декомпозиция по блокове?
A.	#define BLOCK_LOW (id,p,n)((id)*(n)/(p))
B.	#define BLOCK_LOW (id,p)((id)*(p))
C.	#define BLOCK_LOW (id ,n)((id)*(n))
D.	#define BLOCK_LOW (id,p,n,m)(((id)*(n)/(p))*m)
Answer: A

========================
Л3С6
В кой от редовете е изписан правилно макроса BLOCK_HIGH за декомпозиция по блокове?
A.	#define BLOCK_HIGH (id,p,n)(BLOCK_LOW((id)+1,p,n)-1)
B.	#define BLOCK_HIGH (id,p,n)(BLOCK_SIZE((id)+1,p,n)-1)
C.	#define BLOCK_HIGH (id,p,n)(BLOCK_LOW((id)+1,p,n)-2)
D.	#define BLOCK_HIGH (id,p,n)(BLOCK_OWNER((id)+1,p,n)-1)
Answer: A

========================
Л3С6
В кой от редовете е изписан правилно макроса BLOCK_SIZE за декомпозиция по блокове?
A.	#define BLOCK_SIZE (id,p,n)(BLOCK_LOW((id)+1)-BLOCK_LOW(id))
B.	#define BLOCK_SIZE (id,p,n)(BLOCK_HIGH((id)+1)-BLOCK_LOW(id))
C.	#define BLOCK_SIZE (id,p,n)(BLOCK_SIZE((id)+1)-BLOCK_LOW(id))
D.	#define BLOCK_SIZE (id,p,n)(BLOCK_OWNER((id)+1)-BLOCK_LOW(id))
Answer: A

========================
Л3С6
В кой от редовете е изписан правилно макроса BLOCK_OWNER за декомпозиция по блокове?
A.	#define BLOCK_OWNER (index,p,n) (((p)*((index+1)-1)/(n))
B.	#define BLOCK_OWNER (index,p,n)(BLOCK_HIGH(((p)*((index+1)-1)/(n))
C.	#define BLOCK_OWNER (index,p,n)(((n)*((index+1)-2)/(p))))
D.	#define BLOCK_OWNER (index,p,n)(BLOCK_OWNER((index)+1)-BLOCK_LOW(p))
Answer: A

========================
Л3С7
За даден процес с ранг ID и брой на елементите n, макроса BLOCK_LOW определя...?
A.	Min index който е обработван от процеса
B.	Стойността на max index обработван от процеса
C.	Определя броя на елементите, обработвани от процес ID
D.	Определя ранга на процеса, отговорен за обработка на елемента
Answer: A

========================
Л3С7
Макросът BLOCK_HIGH определя...?
A.	Min index който е обработван от процеса
B.	Стойността на max index обработван от процеса
C.	Определя броя на елементите, обработвани от процес ID
D.	Определя ранга на процеса, отговорен за обработка на елемента
Answer: B

========================
Л3С7
Макросът BLOCK_SIZE определя...?
A.	Min index който е обработван от процеса
B.	Стойността на max index обработван от процеса
C.	Определя броя на елементите, обработвани от процес ID
D.	Определя ранга на процеса, отговорен за обработка на елемента
Answer: C

========================
Л3С7
Макросът BLOCK_OWNER определя...?
A.	Min index който е обработван от процеса
B.	Стойността на max index обработван от процеса
C.	Определя броя на елементите, обработвани от процес ID
D.	Определя ранга на процеса, отговорен за обработка на елемента
Answer: D

========================
Л3С8
От показаното на изображението, кои са Глобалните индекси?
 
A.	Част А
B.	Част B
Answer: A

========================
Л3С8
От показаното на изображението, кои са Локалните индекси?
 
A.	Част А
B.	Част B
Answer: B

========================
Л3С9
Какво е характерно за една паралелна програма?
A.	Всеки процес създва своята част от общия списък, съдържащ съответния брой булеви стойности
B.	Всеки процес създава нов списък, съдържащ съответния брой десетични стойности
C.	Процеса запазва своите стойности в регистъра на процесора, затова не му е нужен списък
D.	Нито едно от посочените
Answer: A

========================
Л3С9
Какво е характерно за една паралелна програма?
A.	Всеки процес трябва да знае стойността на k, за да може да маркира числата кратни на k
B.	Всеки процес създава нов списък, съдържащ съответния брой стойности кратни на k
C.	Процеса запазва своите стойности в регистъра на процесора, затова не му е нужен списък в който да запазва каквото и да е
D.	Нито едно от посочените
Answer: A

========================
Л3С9
Какво е характерно за една паралелна програма?
A.	Всеки процес трябва да маркира всички числа, кратни на k в неговия блок между k^2 и n
B.	Всеки процес създава нов списък, съдържащ съответния брой стойности кратни на k
C.	Процеса запазва своите стойности в регистъра на процесора, затова не му е нужен списък в който да запазва каквото и да е
D.	Нито едно от посочените
Answer: A

========================
Л3С10
Какво е характерно за една паралелна програма?
A.	Процес 0 трябва да определи следващата стойност на k и да я изпрати на останалите процеси
B.	Всеки процес създава определя сам на себе си стойността на k
C.	Стойността на k не се копира в локалните инстанции
D.	Нито едно от посочените
Answer: A

========================
Л3С10
Какво е характерно за една паралелна програма?
A.	Стойността на k трябва да се копира в локалните инстанции на k в останалите процеси
B.	Всеки процес създава определя сам на себе си стойността на k
C.	Стойността на k не се копира в локалните инстанции
D.	Нито едно от посочените
Answer: A

========================
Л3С10
Какво е характерно за една паралелна програма?
A.	Broadcasting
B.	Multicasting
C.	Unicasting
D.	Нито едно от посочените
Answer: A

========================
Л3С10
Какво представлява Broadcasting-а при една паралелна програма?
A.	Функция за глобална комуникация
B.	Функция за локална комуникация
C.	Функция за адресиране на дадена комуникация
D.	Нито едно от посочените
Answer: A

========================
Л3С12
Какво представлява функцията MPI_Bcast?
A.	Един процес изпраща едни и същи данни към всички останали процеси в рамките на комуникатора
B.	Много процеси изпращат едни и съи данни към един процес в рамките на комуникатора
C.	Един процес изпраща различни данни към един и същ процес в рамките на комуникатора
D.	Нито едно от посочените
Answer: A

========================
Л3С13
При изпълнението на следната функция със следните зададени параметри, какъв ще бъде резултата?
MPI_Bcast (&k, 1, MPI_INT, 0, MPI_COMM_WORLD)
A.	След ипълението на broadcast, всеки процес разполага с актуална стойност на k
B.	Всеки процес преброява простите числа в подмасива си
C.	След ипълнението на broadcast, всеки процес разполага с всички числа кратни на k
D.	Нито едно от посочените
Answer: A B

========================
Л3С13
При изпълнението на следната функция със следните зададени параметри, какъв ще бъде резултата?
MPI_Bcast (&k, 1, MPI_INT, 0, MPI_COMM_WORLD)
A.	Всички процеси изпращат сумата на простите си числа към процес 0 като извикват функцията MPI_Reduce
B.	Всеки процес преброява простите числа в подмасива си
C.	След ипълнението на broadcast, всеки процес разполага с всички числа кратни на k
D.	Нито едно от посочените
Answer: A B

========================
Л3С14
Като гледате следният граф на задачите, кой цвят стрелки изобразяват broadcast?
     
A.	Лилавите
B.	Червените
C.	Черните
D.	На този граф няма изобразен broadcast
Answer: A

========================
Л3С14
Като гледате следният граф на задачите, кой цвят стрелки изобразяват reduce ?
     
A.	Лилавите
B.	Червените
C.	Черните
D.	На този граф няма изобразен reduce
Answer: B

========================
Л3С15
При документиране на паралелна програма, хедър файла МyMPI.h какво съдържа?
A.	Съдържа макроси и прототипи на функции за разработване на утилити
B.	Съдържа само макоси на функция която ще се използва за вграждане на утилити
C.	Съдържа само прототипи на функция която ще се използва за вграждане на утилитита
D.	Нито едно от посочените
Answer: A

========================
Л3С15
При документиране на паралелна програма, кое от изброените е вярно.
A.	Дефинираме макро, което изчислява минималната от две стойности
#defiine MIN(a,b) ( (a)<(b) ? (a):(b) )
B.	Потребителят трябва да зададе горната граница на пресяването като аргумент на командна линия; ако липсва – терминираме изпълнението
C.	Потребителят пише само прототипи на функция която ще се използва за вграждане на утилитита
D.	Нито едно от посочените
Answer: A B

========================
Л3С15
При документиране на паралелна програма, какво е особено важно да се извика преди exit?
A.	MPI_Finalize();
B.	MPI_End();
C.	MPI_Fin();
D.	MPI_Disconnect();
Answer: A

========================
Л3С15
Какво прави следният фрагмент програмен код?
If ( argc != 2 ) {
if (!id) printf ( “Command line: %s <m>\n”, argv[0] );
MPI_Finalize();
exit (1);
}
n = atoi (argv[1]);
A.	Програмата ще намери всички прости числа от 2 до n, при което търсим всички прости числа от n-1 int
B.	Програмата ще намери всички естествени числа от 1 до n
C.	Програмата ще намери всички естествени числа от 2 до n-1 int
D.	Нито едно от посочените
Answer: A

========================
Л3С17
С какво разполага всеки процес на една паралелна програма?
A.	Непрекъснат блок от масива за съхранение на marks
B.	Прекъснат блок от масива за съхранение на marks
C.	Непрекъснат блок от масива за съхранение на функции
D.	Прекъснат блок от масива за съхранение на функции
Answer: A

========================
Л3С17
С помощта на макросите се определят ...?
A.	Долната и горната граници на процеса и общият брой на числата за пресяване
B.	Лявата и дясната граници на процеса и общият брой на числата за пресяване
C.	Отговор А и отговор B са верни
D.	Нито един от посочените
Answer: A

========================
Л3С17
Кога работи следният алгоритъм...
low_value = 2 + BLOCK_LOW ( id,p,n-1 ) ;
high_value = 2 + BLOCK_HIGH ( id,p,n-1 ) ;
size = BLOCK_SIZE ( id,p,n-1 ) ;
A.	Алгоритъмът работи само ако найг-голямата стойност в масива на процес 0 е по-голяма от горната граница на пресяване
B.	Алгоритъмът няма да работи
C.	Алгоритъмът работи само ако най-малката стойност в масива на процес 0 е по-малка от n-1 
D.	Нито един от посочените
Answer: A

========================
Л3С18
При изпълнението на една паралелна програма, за какво служи Кодът за проверка на условието?
A.	Ако не е изпълнено – изпълнението на програмата се прекратява
B.	Ако не е изпълнено – изпълнението на програмата продължава
C.	Ако е изпълнено – изпълнението на програмата се прекратява
D.	Ако е изпълнено – изпълнението на програмата продължава
Anawer: A


Л3С19
Какво прави функцията allocate ?
A.	Разпределя дяловете от масива на процесите
B.	Защитава масива от препълване
C.	Разпределя дяловете, така че да не се препълнят
D.	Нито едно от посочените
Answer: A

========================
Л3С19
Коя е най-малката единица в паметта, която може да бъде индексирана в C?
A.	1 байт
B.	2 байта
C.	3 байта
D.	4 байта
Answer: A

========================
Л3С19
Какво ще се случи с програмата ако разпределението на паметта се провали?
A.	Изпълнението на програмата се прекратява
B.	Изпълнението на програмата продължава въпреки грешката
C.	Изпълнението се прекратява след това отново продължава
D.	Нито едно от посочените
Answer: A

========================
Л3С20
Кой процес използва променливата:
If(!id) index=0;
Prime = 2;
A.	Само процес 0
B.	Всички процеси
C.	Само процесите при които няма грешки
D.	Нито едно от посочените
Answer: A

========================
Л3С21
Какво трябва да маркира всеки процес в своя дял от списъка с всички числа?
A.	Трябва да маркира всички числа кратни на простото число между простото число на квадрат и n
B.	Трябва да маркира всички числа кратни на минималното число на степен n
C.	Трябва да маркира всички числа кратни на най-малкото положително число на степен n-1
D.	Нито едно от посочените
Answer: A

========================
Л3С23
Какво прави следният макрос със следните зададени функции?
MPI_Bcast (&prime, 1, MPI_INT, 0, MPI_COMM_WORLD) ;
A.	Процес 0 разпръсква стойността на следващото просто число към останалите процеси
B.	Процес 0 подава стойността която му е зададена към един процес
C.	Зададеният макрос е грешен
D.	Нито едно от посочените
Answer: A

========================
Л3С24
До кога процесите продължават да пресяват?
A.	Процесите продължават да пресяват докато квадрата на текущото просто число е < или = на горната граница
B.	Процесите продължават да пресяват докато не свърши масива
C.	Процесите продължават да пресяват докато квадрата на най-малкото положително число в > или = на горната граница
D.	Нито едно от посочените
Answer: A

========================
Л3С24
Какво ще се случи след изпълнението на следният фрагмент ?
MPI_Reduce (&count, &global_count, 1, MPI_INT, MPI_SUM, 0, MPI_COMM_WORLD) ;
A.	Общата сума на процесите се съхранява в глобална променлива global_count в процес 0
B.	Общата сума на процесите се съхранява в променливата count и ще се присвои 1 като стойност
C.	Общата сума на процесите се съхранява в глобална променлива global_count в процес с ID 1
D.	Нито едно от посочените
Answer: A

========================
Л3С25
Какво ще се запазва в променливата elapsed_time?
elapsed_time += MPI_Wtime () ;
A.	Съдържа броя на секундите за изпълнението на даден алгоритъм без да отчита MPI Startup
B.	Съдържа броя на пътите в които алгоритъма се е изпълнил без грешка
C.	Съдържа броя на пътите в които алгоритъма се е изпълнил с грешка
D.	Нито едно от посочените
Answer: A

========================
Л3С27
Кое от изброените е вярно при елиминирането на broadcast?
A.	При изпълнението на програмата процес 0 многократно определя новата стойност на текущото кратно число и я изпраща към останалите процеси
B.	Всеки процес може сам да си определя новата стойност на кратно число
C.	Обработват се само нечетните числа
D.	Обработват се само четните числа на базата на вече намерените излишни булеви стойности
Answer: A B

========================
Л3С27
Кое от изброените е вярно при елиминирането на broadcast?
A.	Преди намиране на простите числа (примерно от 3 до n) , всеки процес използва последователен алгоритъм за намирането на простите числа  (примерни стойности: от 3 до sqrt(n))
B.	Всеки процес може сам да си определя новата стойност на кратно число
C.	Обработват се само нечетните числа
D.	Обработват се само четните числа на базата на вече намерените излишни булеви стойности
Answer: A B

========================
Л3С33
За идентифициран на паралелизма използваме...
A.	Domain decomposition methodology
B.	Domain broadcasting methodology
C.	Domain unicasting methodology
D.	Нито едно от посочените
Answer: A

========================
Л3С33
Какво използваме върху елементите на масива между процесите?
A.	Блоково разпределение
B.	Масивно разпределение
C.	Не използваме разпределение
D.	Масивно разпределение което предварително е зададено от лявата и дясната граница
Answer: A

========================
Л3С33
Програмата постига добра производителност при масив от 100 млн. числа при изпълнение на какъв клъстър?
A.	Commodity cluster
B.	Community cluster
C.	Parallel cluster
D.	Нито едно от посочените
Answer: A

========================
Л5С2
Какъв проблем решава алгоритъмът методът на Монте Карло?
A.	Проблема на основата на статистическит проби
B.	Проблема на основата на динамичените проби
C.	Проблема на основата на статичните проби
D.	Проблема на основата на тригонометричните проби
Answer: A

========================
Л5С2
Кои от изброените неща се отнасят за методът Монте Карло?
A.	Първото му важно използване е през 2рата световна война за създаването на атомната бомба
B.	Единственият метод за решаване на интеграли за произволно функции за 6 и повече измерения
C.	Първото му важно използване е през 1рвата световна война за създаването на атомната бомба
D.	Решава проблема на основата на тригонометричните проби
Answer: A B

========================
Л5С2
Кои от изброените неща се отнасят за методът Монте Карло?
A.	Използва се за прогнозиране на индекса Dow Jones
B.	Единственият метод за решаване на интеграли за произволно функции за 6 и повече измерения
C.	Първото му важно използване е през 1рвата световна война за създаването на атомната бомба
D.	Решава проблема на основата на тригонометричните проби
Answer: A B

========================
Л5С3
Кои от изброените неща се отнасят за методът Монте Карло?
A.	Използва се за решаване на числено диференциални уравнения
B.	Обработка на образи от сателити
C.	Първото му важно използване е през 1рвата световна война за създаването на атомната бомба
D.	Решава проблема на основата на тригонометричните проби
Answer: A B

========================
Л5С3
Кои от изброените неща се отнасят за методът Монте Карло?
A.	Моделиране на популациите на определени региони
B.	Намиране на приблизителните решения на проблеми с NP сложност за полиномно време
C.	Първото му важно използване е през 1рвата световна война за създаването на атомната бомба
D.	Решава проблема на основата на тригонометричните проби
Answer: A B

========================
Л5С4
В долните редове са изброени примерни приложения за методът на Монте Карло за изчисляване на стойността на числото п (пи). Кои са верни?
A.	Площта на кръг с диаметър D e пD^2/4
B.	Площта на квадрат със страна D e D^2
C.	Площта на обработваема от сателит площ е (D*п)^3-4
D.	Нито едно от посочените
Answer: A B

========================
Л5С4
В долните редове са изброени примерни приложения за методът на Монте Карло за изчисляване на стойността на числото п (пи).  Кои са верни?
A.	Отношението на площите е (п*D^2/4)D^2 = п/4
B.	За оценка иползваме случайни числа
C.	Площта на обработваема от сателит площ е (D*п)^3-4
D.	Нулата като цифра играе особена роля в изчисленията
Answer: A B

========================
Л5С4
В долните редове са изброени примерни приложения за методът на Монте Карло за изчисляване на стойността на числото п (пи). Кои са верни?
A.	Численото интегриране е по-добрата стратегия при по-малък брой на измеренията
B.	Пълен кръг с радиус 1 има площ п (пи)
C.	Площта на обработваема от сателит площ е (D*п)^3-4
D.	Нулата като цифра играе особена роля в изчисленията
Answer: A B

========================
Л5С4- Л3С5
В долните редове са изброени примерни приложения за методът на Монте Карло за изчисляване на стойността на числото п (пи). Кои са верни?
A.	Площта на ¼ от кръга е п е п/4
B.	Генерираме серия от двойки (x,y)
C.	Площта на обработваема от сателит площ е (D*п)^3-4
D.	Нулата като цифра играе особена роля в изчисленията
Answer: A B

========================
Л3С5
В долните редове са изброени примерни приложения за методът на Монте Карло за изчисляване на стойността на числото п (пи). Кои са верни?
A.	Х и у са с равномерно разпределение в интервала 0,1
B.	Х и у са координати на точки вътре в квадрата
C.	Площта на обработваема от сателит площ е (D*п)^3-4
D.	Нулата като цифра играе особена роля в изчисленията
Answer: A B

========================
Л3С5
В долните редове са изброени примерни приложения за методът на Монте Карло за изчисляване на стойността на числото п (пи). Кои са верни?
A.	Проследяваме частта f от точките, попадащи вътре в ¼ от кръга
B.	Абсолютната грешка бавно намалява с увеличаването на броя на точките
C.	Площта на обработваема от сателит площ е (D*п)^3-4
D.	Нулата като цифра играе особена роля в изчисленията
Answer: A B

========================
Л5С8
Какво е вярно за графиката която е показана?
 
A.	Площта под кривата f(x) e еднаква с тази под   - средната стойност на f(x) в интервала [a,b]
B.	Площта под кривата f(x) не е еднаква с тази под   
C.	Площта под кривата f(x) e еднаква с тази под   - Най-голямата стойност на f(x) е в интервала [a,b]
D.	Нито едно от посочените
Answer: A

========================
Л5С14
Кое е вярно за методът на Монте Карло когато става въпрос за паралелна обработка?
A.	Алгоритмите лесно се трансформират за паралелни системи
B.	Алгоритмите не могат да се трансформират за паралелно системи
C.	Случайните числа не са статистически независими
D.	Нито едно от посочените
Answer: A

========================
Л5С14
Кое е вярно за методът на Монте Карло когато става въпрос за паралелна обработка?
A.	Алгоритмите се характеризират с пренебрежимо малко междупроцесорни комуникации
B.	Алгоритмите се характеризират с много междупроцесорни комуникации
C.	Случайните числа не са статистически независими
D.	Нито едно от посочените
Answer: A

========================
Л5С14
Кое е вярно за методът на Монте Карло когато става въпрос за паралелна обработка?
A.	Бързодействието при р процесора е р пъти и грешката при оценката се намалява с фактора sqrt(p)
B.	Алгоритмите се характеризират с много междупроцесорни комуникации
C.	Случайните числа не са статистически независими
D.	Нито едно от посочените
Answer: A

========================
Л5С14
Кое е вярно за методът на Монте Карло когато става въпрос за паралелна обработка?
A.	Случайните числа са статистически независими
B.	Алгоритмите се характеризират с много междупроцесорни комуникации
C.	Случайните числа не са статистически независими
D.	Нито едно от посочените
Answer: A

========================
Л5С15
Кое от изброените по-долу неща се счита за основно предимство на методът Монте Карло?
A.	Добри паралелни генератори на случайни числа
B.	Бавен, но точен алгоритъм
C.	Предсказуем алгоритъм
D.	Нито едно от посочените
Answer: A

========================
Л5С17
Кое от изброените по-долу неща са свойства на идеалния генератор на случайни числа?
A.	Равномерно разпределение
B.	Числата не са корелирани
C.	Числата се повтарят
D.	Машинно  - зависими
Answer: A B

========================
Л5С17
Кое от изброените по-долу неща са свойства на идеалния генератор на случайни числа?
A.	Числата никога не се повтарят
B.	Удовлетворяват всеки тест за случайност
C.	Числата се повтарят
D.	Машинно  - зависими
Answer: A B

========================
Л5С17
Кое от изброените по-долу неща са свойства на идеалния генератор на случайни числа?
A.	Машинно – независими – генераторът създава една и съща последователност на различни машини
B.	Лесно може да се променя последователността като се променя “seed”
C.	Числата се повтарят
D.	Машинно  - зависими – генераторът създава различна последователност за една и съща машина
Answer: A B

========================
Л5С17
Кое от изброените по-долу неща са свойства на идеалния генератор на случайни числа?
A.	Лесно се разцепва на множество независими последователности
B.	Последователността се генерира бързо
C.	Числата се повтарят
D.	Машинно  - зависими – генераторът създава различна последователност за една и съща машина
Answer: A B

========================
Л5С17
Кое от изброените по-долу неща са свойства на идеалния генератор на случайни числа?
A.	Генераторът изисква ограничена компютърна памет
B.	Не съществуват реални генератори, удовлетворяващи всички изисквания
C.	Числата се повтарят
D.	Машинно  - зависими – генераторът създава различна последователност за една и съща машина
Answer: A B

========================
Л5С17
Кое от изброените по-долу неща са свойства на идеалния генератор на случайни числа?
A.	Притежават аритметика с ограничена точност
B.	Периодът на генератора е неговия цикъл
C.	Числата се повтарят
D.	Машинно  - зависими – генераторът създава различна последователност за една и съща машина
Answer: A B

========================
Л5С20
Кое от изброените важи за линейно конгруентните генератори?
A.	Използват се и за генериране на числа с плаваща точка
B.	Генерират се цли числа от 0 до М-1, Хi се дели на М, като се създават числа с плаваща точка Хi в интервала [0,1)
C.	Максимум могат да генерират 3 милиарда случайни числа
D.	Тези генератори са с ограничена точност
Answer: A B

========================
Л5С20
Кои от изброените са недостатъци на линейно конгруентните генератори?
A.	Младшите битове са колерирани
B.	Влошават се при увеличаването на размерността
C.	Максимум могат да генерират до 3 милиарда случайни числа
D.	Използват се и за генериране на числа с плаваща точка
Answer: A B

========================
Л5С20
Кои от изброените са недостатъци на линейно конгруентните генератори?
A.	При 48-бита са добри за последователните компютри
B.	Влошават се при увеличаването на размерността
C.	Максимум могат да генерират до 3 милиарда случайни числа
D.	Използват се и за генериране на числа с плаваща точка
Answer: A B

========================
Л5С21
Кое от изброените е характерно за Lagged Fibonacci генераторите?
A.	Последователности с големи периоди
B.	Последователности с малки периоди
C.	Ниско бързодействие
D.	Липса на последователност
Answer: A

========================
Л5С21
Кое от изброените е характерно за Lagged Fibonacci генераторите?
A.	Високо бързодействие
B.	Последователности с малки периоди
C.	Ниско бързодействие
D.	Липса на последователност
Answer: A

========================
Л5С21
Кое от изброените е характерно за Lagged Fibonacci генераторите?
A.	Всеки елемент Xi наа последователността се дефинита като 
Xi = Xi-p ¤ Xi-q
p,q – lags, p>q,
B.	Последователности с малки периоди
C.	Ниско бързодействие
D.	Липса на последователност
Answer: A

========================
Л5С22
Кое от изброените е характерно за Lagged Fibonacci генераторите?
A.	Функцията random, извиквана от С, е фибоначи генератор на случайни чиса – default lag е 31
B.	Последователности с малки периоди
C.	Ниско бързодействие
D.	Липса на последователност
Answer: A

========================
Л5С22
Кое от изброените е характерно за Lagged Fibonacci генераторите?
A.	Coddington – 31 е малко – препоръчвана (p,q) да бъде поне (1279,1063)
B.	Последователности с малки периоди
C.	Ниско бързодействие
D.	Липса на последователност
Answer: A

========================
Л5С22
Кое от изброените е характерно за Lagged Fibonacci генераторите?
A.	Увеличаването на p води до увеличаване на периода, но и завишава изискванията за памет
B.	Последователности с малки периоди
C.	Ниско бързодействие
D.	Липса на последователност
Answer: A

========================
Л5С23
Кои са изискваните неща които трябва да притежава един генератор на случайни числа?
A.	Не трябва да има корелации между отделните последователности
B.	Мащабируемост – голям брой процеси, всеки със свой поток от числа
C.	Споделяне на паметта – едно генерирано число да може да се сподели и със други процеси
D.	Нито едно от посочените
Answer: A B

========================
Л5С23
Кои са изискваните неща които трябва да притежава един генератор на случайни числа?
A.	Локалност – всеки процес да бъде в състояние да генерира нова последователност от числа без необходимост от комуникация с други процеси
B.	Мащабируемост – голям брой процеси, всеки със свой поток от числа
C.	Споделяне на паметта – едно генерирано число да може да се сподели и със други процеси
D.	Нито едно от посочените
Answer: A B

========================
Л5С24
При метода Manager – Worker, каква функция изпълнява процесът manager?
A.	Генерира случайни числа и ги разпределя между процесите worker
B.	Генерира бинарни числа и ги разпределя според ранговете на процесите worker
C.	Генерира четни числа и ги разпределя между процесите worker
D.	Нито едно от посочените
Answer: A

========================
Л5С24
Кои са недостатъците на метода Manager – Worker?
A.	Някои случайни генератори създават последователности с широкообхватни корелации
B.	Всички процеси получават числа от еднаи съща последователност
C.	Всички процеси получават числа от различни последователности
D.	Получават се корелации в голям обхват на паралелните последователности
Answer: A B

========================
Л5С24
Кои са недостатъците на метода Manager – Worker?
A.	Получаване на корелации в малък обхват на паралелните последователности
B.	Всички процеси получават числа от еднаи съща последователност
C.	Всички процеси получават числа от различни последователности
D.	Получават се корелации в голям обхват на паралелните последователности
Answer: A B

========================
Л5С25
Какво е характерно за метода „скок на жабата“ ?
A.	Циклично разпределяне на данните между задачите
B.	Всички p процеса използват един и същи последователен генератор на случайни числа
C.	Еднократно разпределяне на данните между задачите
D.	Всеки р процес използва различен последователен генератор на случайни числа
Answer A B

========================
Л5С25
Какво можем да установим от следната схема показваща метода „скок на жабата?
 
A.	Процес  р  с ранг r взема всеки р-ти елемент от последователността, започвайки с Хi
B.	Процес  r  с ранг p взема всеки i-ти елемент
C.	Процес  Хi  с ранг p взема всеки r-ти елемент
D.	Нито едно от посочените
Answer: A

========================
Л5С26
Как един линеен конгруентен генератор ще се трансформира в генератор на фибоначи?
A.	Когато заменим а със a^p mod M и заменим c със c*(a^p-1)mod M
B.	Линейният конгруентен генератор не може да се трансформира в генератор на фибоначи
C.	Нито едно от посочените
Answer: A

========================
Л5С27
Кои са недостатъците на метода „скок на жабата“ ?
A.	Елементите в генерираната последователност могат да бъдат корелирани за определени стойности на p, дори когато елементите на изходната последователност имат ниска корелация
B.	Елементите в генерираната последователност могат да се повтарят неколкократно при повторното извикване на процес с ID r
C.	Висока корелация между процесите
D.	Нито едно от посочените
Answer: A

========================
Л5С27
Кои са недостатъците на метода „скок на жабата“ ?
A.	При използването на линейно конгруентния метод, p е степен на 2 и M e степен на 2
B.	Елементите в генерираната последователност могат да се повтарят неколкократно при повторното извикване на процес с ID r
C.	Висока корелация между процесите
D.	Нито едно от посочените
Answer: A

========================
Л5С27
Кои са недостатъците на метода „скок на жабата“ ?
A.	Широкообхватните корелации -> малообхватни корелации
B.	Елементите в генерираната последователност могат да се повтарят неколкократно при повторното извикване на процес с ID r
C.	Висока корелация между процесите
D.	Нито едно от посочените
Answer: A

========================
Л5С28
Кое от описаните по-долу са верни при разцепване на последователността?
A.	Аналогично е на разпределянето на данните по блокове между задачите
B.	Изходният генератор има период р
C.	Последните р числа от генератора се разделят на равни части между процесите
D.	Няма риск от корелации между последователностите на процесите
Answer: A B

========================
Л5С28
Кое от описаните по-долу са верни при разцепване на последователността?
A.	Първите р числа от генератора се разделят на равни чсти между процесите, по една част на процес
B.	Риск от корелации между последователностите на процесите
C.	Последните р числа от генератора се разделят на равни части между процесите
D.	Няма риск от корелации между последователностите на процесите
Answer: A B

========================
Л5С29
Какво представлява параметризацията?
A.	Всеки процес изпълнява отделен последователен случаен генератор
B.	Инициализацията на генератора се осъществява с различни параметри
C.	Линейните конгруентни генератори не използват една и съща константа два пъти
D.	Нито едно от посочените
Answer: A B

========================
Л5С29
Какво представлява параметризацията?
A.	Линейните конгруентни генератори използват различни конгруентни константи за генерирането на различни потоци
B.	Генераторите Фибоначи използват различни начални таблици с lags
C.	Линейните конгруентни генератори не използват една и съща константа два пъти
D.	Нито едно от посочените
Answer: A B

========================
Л5С29
Какво представлява параметризацията?
A.	Отделен генератор създава „seeds”
B.	Генераторите Фибоначи използват различни начални таблици с lags
C.	Линейните конгруентни генератори не използват една и съща константа два пъти
D.	Нито едно от посочените
Answer: A B

========================
Л5С33
В кой ред е изписан вид Експоненциалното разпределение?
A.	Разпадането на радиоактивните атоми
B.	Дистанцията на пътя на неутрота в течно тяло преди 
C.	Интеграция на функция намираща кумулативно разпределениe
D.	Нито едно от посочените
Answer: A

========================
Л5С33
В кой ред е изписан вид Експоненциалното разпределение?
A.	Дистанцията на пътя на неутрона в твърно тяло преди да взаимодейства с атом
B.	Дистанцията на пътя на неутрота в течно тяло преди 
C.	Интеграция на функция намираща кумулативно разпределениe
D.	Нито едно от посочените
Answer: A

========================
Л5С33
В кой ред е изписан вид Експоненциалното разпределение?
A.	Времето за пристигане на нов клиент в център за обслужване
B.	Дистанцията на пътя на неутрота в течно тяло преди 
C.	Интеграция на функция намираща кумулативно разпределениe
D.	Нито едно от посочените
Answer: A

========================
Л5С38
Каква е целта на трансформацията на Box-Muller?
A.	Целта е да се генерират числа с нормално (Гаусово) разпределение.
B.	Целта е да се изчисли изпълнението на отделен последователен случаен генератор
C.	Целта е да се генерира ред на Фибоначи използвайки различни начални таблици с lags
D.	Нито едно от посочените
Answer: A

========================
Л5С38
Какво ни дава трансформацията на Box-Muller?
A.	Трансформацията дава възможност да се генерират двойка стандартни отклонения g1 и g2 от двойка равномерни отклонения u1 и u2
B.	Трансформацията дава възможност  да се генерира ред на Фибоначи използвайки различни начални таблици с lags
C.	Трансформацията дава възможност  да се изчисли изпълнението на отделен последователен случаен генератор
D.	Нито едно от посочените
Answer: A

========================
Л5С40
Как може да се използва трансформацията на Box-Muller?
A.	Може да се използва за създаването на функция, която връща стойност със стандартно отклонение
B.	Може да се използва за генериране ред на Фибоначи използвайки различни начални таблици с lags
C.	Може да се използва за изчисление изпълнението на отделен последователен случаен генератор
D.	Нито едно от посочените
Answer: A

========================
Л5С43
Кое от изброените е вярно за методът на отхвърлянето?
A.	Дава възможност да се създават стойности с фунция на плътност на разпределението f(x), които не можем да интегрираме и/или инвертираме по аналитиче път
B.	Може да се използва за изчисление изпълнението на отделен последователен случаен генератор
C.	Може да се използва за създаването на функция, която връща стойност със стандартно отклонение
D.	Нито едно от посочените
Answer: A

========================
Л5С43
Кое от изброените е вярно за методът на отхвърлянето?
A.	Генерираме проби с плътност на разпределение h(x)
B.	Може да се използва за изчисление изпълнението на отделен последователен случаен генератор
C.	Може да се използва за създаването на функция, която връща стойност със стандартно отклонение
D.	Нито едно от посочените
Answer: A

========================
Л5С45
Кога ефективността на метода на отхвърляне намалява рязко?
A.	При увеличаване на броя на измеренията
B.	При намаляване на броя на измеренията
C.	При нулев брой на измеренията
D.	Нито едно от посочените
Answer: A

========================
Л6С2
Колко възможни начина съществуват за движение на неутроните
A.	3
B.	2
C.	1
D.	0
Answer A

========================
Л6С2
Кои са 3-те възможни начина за движение на неутрона?
A.	Отразяване, абсорбиране, преминаване през преградата
B.	Отрязване, абониране, изрязване на преградата
C.	Отлежаване, излъчване, ограничаване на преградата
D.	Нито едно от посочените
Answer A

========================
Л6С3
На показаната по-долу схема, коя е буквата която изобразява Отразяване на неутрона?
 
A.	A
B.	B
C.	C
D.	Нито едно от посочените
Answer A

========================
Л6С3
На показаната по-долу схема, коя е буквата която изобразява Абсорбиране на неутрона?
 
A.	A
B.	B
C.	C
D.	Нито едно от посочените
Answer B

========================
Л6С3
На показаната по-долу схема, коя е буквата която изобразява Преминаване през преградата на неутрона?
 
A.	A
B.	B
C.	C
D.	Нито едно от посочените
Answer C

========================
Л6С6
До кога продължава симулацията на движение на неутрона?
A.	Докато неутронът не се абсорбира от атом
B.	Докато неутрона изчезне
C.	Докато позицията Х на неутрона е положителна
D.	Докато неутрона си седи вътре в преградата
Answer A

========================
Л6С6
До кога продължава симулацията на движение на неутрона?
A.	Позицията Х на неутрона е отрицателна, което означава, че той е отразен от преградата
B.	Докато неутрона изчезне
C.	Докато позицията Х на неутрона е положителна
D.	Докато неутрона си седи вътре в преградата
Answer A

========================
Л6С6
До кога продължава симулацията на движение на неутрона?
A.	Позицията Х на неутрона е > H ,което означава, че той е преминал през преградата
B.	Докато неутрона изчезне
C.	Докато позицията Х на неутрона е положителна
D.	Докато неутрона си седи вътре в преградата
Answer A

========================
Л6С6
Какво представлява изразът „Време по Монте Карло“ ?
A.	Симулацията се развива от едно събитие към друго събитие
B.	Симулацията на събитията се развива паралелно
C.	Симулацията на събитията се развива успоредно
D.	Симулацията на събитията отнема прекалено много време, защото алгоритъмът на Монте Карло е сравнително бавен
Answer A

========================
Л6С17
Кое от изброените се отназя за алгоритъмът Metropolis?
A.	Последователността от случайни проби се нарича верига на Марков.
B.	При малобройни проби, алгоритъмът не осигурява особено добро покритие на цялата функция
C.	При къси последователни и случайни проби, алгоритъмът на метрополис създава прекалено много корелирани връзки
D.	Нито едно от посочените
Answer A

========================
Л6С17
Кое от изброените се отназя за алгоритъмът Metropolis?
A.	Късите последователности от случайни проби по алгоритъма Метрополис са силно корелирани
B.	При малобройни проби, алгоритъмът не осигурява особено добро покритие на цялата функция
C.	При къси последователни и случайни проби, алгоритъмът на метрополис създава прекалено много корелирани връзки
D.	Нито едно от посочените
Answer A

========================
Л6С17
Кое от изброените се отназя за алгоритъмът Metropolis?
A.	При многобройни проби, алгоритъмът осигурява добро покритие на цялата функция на плътността на разпределение
B.	При малобройни проби, алгоритъмът не осигурява особено добро покритие на цялата функция
C.	При къси последователни и случайни проби, алгоритъмът на метрополис създава прекалено много корелирани връзки
D.	Нито едно от посочените
Answer A

========================
Л6С19
Какво представлява Симулираното закаляване при проблемът за разпределение на стаите?
A.	Итеративен алгоритъм
B.	Неитеративен алгоритъм
C.	Диференциален алгоритъм
D.	Корелиращ алгоритъм
Answer A

========================
Л6С19
Кое от изброените по-долу неща са верни, що се отнася за проблема с разпределението на стаите?
A.	При всяка итерация текущото решение се променя случайно за получаване на алтернативно решение
B.	Новото решение става текущо, ако стойността на целевата функция е по-малка
C.	Новото решение не се приема когато е по-малко от 0
D.	Решенията нямат нито локални максимуми, нито локални минимуми
Answer A B

========================
Л6С19
Кое от изброените по-долу неща са верни, що се отнася за проблема с разпределението на стаите?
A.	Решенията обикновенно имат локални минимуми, при високи температури – лесно се излиза от локалните минимуми
B.	Новото решение става текущо, ако стойността на целевата функция е по-малка
C.	Новото решение не се приема когато е по-малко от 0
D.	Решенията нямат нито локални максимуми, нито локални минимуми
Answer A В

========================
Л6С21
При процедурата за алгоритъма с каляване, какво ни осигурява симулираното каляване?
A.	Винаги осигурява възможност за търене на ново решение с по-ниска цена
B.	Винаги осигурява допълнителна проверка за минимизация на грешки
C.	Винаги осигурява висока цена на решението
D.	Нито едно от посочените
Answer A

========================
Л6С21
Кое от изброените се отнася за процедурата за алгоритъма с каляване?
A.	Вероятността за генериране на решение с по-висока цена намаляв с понижаването на температурата
B.	Генерирането на решение с по-висока цена е с по-голяма вероятност при високи температури
C.	Вероятността за възникване на грешка при решение е се увеличава с понижаване на температурата
D.	Нито едно от посочените
Answer: A B

========================
Л6С21
Кое от изброените се отнася за процедурата за алгоритъма с каляване?
A.	Генерирането на решение с по-висока цена е с по-малка при ниски температури
B.	Генерирането на решение с по-висока цена е с по-голяма вероятност при високи температури
C.	Вероятността за възникване на грешка при решение е се увеличава с понижаване на температурата
D.	Нито едно от посочените
Answer: A B

========================
Л8С2
За какво се използват комбинаторните алгоритми?
A.	Обработка на дискретни и крайни математически структури
B.	Обработка на крайни автомати
C.	Обработка на комбинаторни процеси
D.	Обработка на дискретни комбинаторни процеси
Answer A

========================
Л8С2
Какво представлява Комбинаторното търсене?
A.	Процес на намиране на едно или повече оптимални или субоптимални решения в дефинирано пространство на проблема
B.	Процес на намиране на едно или повече минимални решения в пространството на проблема
C.	Процес на намиране на локалният максимум като решение на поставеният проблем
D.	Нито едно от посочените
Answer A

========================
Л8С2
В кой ред са изброени проложения на комбинаторното търсене?
A.	Проектиране на МГИС при минимална площ,  планиране на движенията на ръцете на робот при минимално изминато разстояние, доказване на теориеми, игри
B.	Изчисляване на минимален път, планиране на най-добър (с най-ниска цена) маршрут, Определяне на локални минимуми и максимуми на функции
C.	Намиране на най-голямо общо кратно на уравнение, намиране на дълбочината на точка, изчисляване на разстоянието от земята до небесни тела, намиране на решения на уравнения с много неизвестни
D.	Нито едно от посочените
Answer A

========================
Л8С3
В кой ред е описан проблем на комбинаторното търсене?
A.	Алгоритми, отговарящи на въпроса Съществува ли решение на оптимизационни проблеми – „Да“ или „Не“
B.	Алгоритми които нямат крайно решение
C.	Алгоритми чието решение е безкрайна функция
D.	Нито едно от посочените
Answer A

========================
Л8С3
В кой ред е описан проблем на комбинаторното търсене?
A.	Алгоритми, решаващи оптимизационни проблеми – намират решение, което намира минимум или максимум на стойността на функция на обекта
B.	Алгоритми които нямат крайно решение
C.	Алгоритми чието решение е безкрайна функция
D.	Нито едно от посочените
Answer A

========================
Л8С4
В кой ред са описани неща характерни за Дърво на търсене?
A.	При всички случаи коренът на дървото представя оригиналния проблем
B.	Дълбочината и вида му зависят от решавания проблем
C.	Дървото има няколко начина за обход, като се започва от най-вътрешният корен
D.	Дълбочината му зависи от размера на файла който бива обхождан
Answer: A B

========================
Л8С4
При дърво на търсене, какво представлява възел от тип “AND”?
A.	Проблем или подпроблем, който се решава тогава и само тогава, когато всичките му деца са решени
B.	Проблем или подпроблем който няма решение
C.	Проблем или подпроблем който намира решение тогава и само тогава когато е намерен локалният минимум на фунцията по която е зададен проблема
D.	Нито едно от посочените
Answer: A

========================
Л8С4
При дърво на търсене, какво представлява възел от тип “OR”?
A.	Проблем или подпроблем, който се решава когато някое от децата има решение
B.	Проблем или подпроблем който няма решение
C.	Проблем или подпроблем който намира решение тогава и само тогава когато е намерен локалният минимум на фунцията по която е зададен проблема
D.	Нито едно от посочените
Answer: A

========================
Л8С5
Какво представлява AND дърво на търсене?
A.	Решението на проблема се намира като се комбинират решенията на всичи подпроблеми (алгоритми „ разделяй- и – владей“ )
B.	Решението се намира като се комбинират всички намерени локални максимуми
C.	Решениео се намира като се комбинират всички намерени локални минимуми
D.	Нито едно от посочените
Answer A

========================
Л8С5
Какво представлява OR дърво на търсене?
A.	Решението на проблема се намира когато поне един от проблемите е решен (търсене с обратен ход или търсене с клони и граници)
B.	Решението се намира като се комбинират всички намерени локални максимуми
C.	Решениео се намира като се комбинират всички намерени локални минимуми
D.	Нито едно от посочените
Answer A

========================
Л8С5
Алгоритъмът „разделяй-и-владей“ от какъв тип дърво е?
A.	AND дърво
B.	OR дърво
C.	AND/OR дърво
D.	Нито едно от посочените
Answer A

========================
Л8С5
AND/OR дърветата са предназначени за ...
A.	Игри
B.	Безкрайни цикли
C.	Тригонометрични функции
D.	Нито едно от посочените
Answer A

========================
Л8С6
Какво представлява алгоритъмът „разделяй – и – владей“ ?
A.	Рекурсивна методология за решаване на проблеми, при която проблемът се разделя на подпроблеми, подпроблемите се решават и техните решения се комбинират а да се получи решението на изходния проблем
B.	Рекурсивна методология за решаване на проблеми, при която даден проблем не може да бъде решен
C.	Рекурсивна методология а решаване на проблеми , които трудно могат да намерят начин заимплементация
D.	Нито едно от посочените
Answer: A

========================
Л8С6
Какво е характерно за алгоритъмът „Разделяй – и – владей“ ?
A.	Използват AND дървета
B.	По-лесно се имплементират на симетрични мулипроцесори отколкото на мултикомпютри
C.	Използват OR дървета
D.	Нито едно от посочените
Answer: A B

========================
Л8С7
Какво е характерно за алгоритъмът „разделяй – и – владей“ при мултикомпютрите?
A.	Подпроблемите се разпределят между локалните памети на процесорите, изчислителният товар нараства динамично, след което намалява, един процесор съдържа оригиналния проблем и накрая съдържа решението
B.	Оригиналният проблем и полученото решение са разпределени между процесите
C.	Рекурсивна методология а решаване на проблеми , които трудно могат да намерят начин заимплементация
D.	Решениео се намира като се комбинират всички намерени локални минимуми
Answer: A B

========================
Л8С7
Какъв проблем се среща при мултикомпютрите при алгоритъма „разделяй – и – владей“?
A.	Ефективен баланс на паралелния изчислителен товар
B.	Неефективен баланс на паралелния изчислителен товар
C.	Неадекватно държание на паралелния изчислителен товар
D.	Нито едно от посочените
Answer A

========================
Л8С9
Какво представлява алгоритъма „търсене с обратен ход“ ?
A.	Метод за решаване на комбинаторни оптимизационни проблеми, който се основава на обхождане по дълбочина (depth-first search) за разглеждане на алтернативите
B.	Метод за решаване на тригонометрични проблеми, без повторно разглеждане на алтернативите
C.	Метод за решаване на комбинаторни проблеми, при който се намира най НЕоптималното решение
D.	Нито едно от посочените
Answer A

========================
Л8С9
Какво е характерно за методът „ търсене с обратен ход“ ?
A.	Генерират се децата на основния проблем (корена) и се избира едно от тях за да продължи търсенето
B.	Тази методология се повтаря рекурсивно за всеки избран възел
C.	Метод за решаване на комбинаторни проблеми, при които се намира най- НЕоптималното решение
D.	Неефективен баланс на паралелния изчислителен товар
Answer: A B

========================
Л8С9
Какво е характерно за методът „ търсене с обратен ход“ ?
A.	Генерират се децата на основния проблем (корена) и се избира едно от тях за да продължи търсенето
B.	При достигане на възел, който не може да бъде разширен (dead end), или ако всички поддървета на детето са вече разгледани, управлението се връща на предходният възел (backtrack – обратен ход)
C.	Метод за решаване на комбинаторни проблеми, при които се намира най- НЕоптималното решение
D.	Неефективен баланс на паралелния изчислителен товар
Answer: A B

========================
Л8С11
Какво е изобразено на следната схема?
 
A.	Паралелно търсе с обратен ход
B.	Непаралелно търсене с обратен ход
C.	Паралелно търсене с обратен изход
D.	Паралелно търсене с изход
Answer A

========================
Л8С11
Каква стратегия е изобразена на показаната схема?
 
A.	Разделяне на търсенето в поддърветата между процесите
B.	Рапределяне на паметта за да не се получи препълване на буфера
C.	Разпределяне на търсенето във възлите между различните дървета
D.	Нито едно от посочените
Answer A

========================
Л8С13
Кое от изброените неща, може да се смята като проблем при дърветата на пространството на търсене?
A.	Дърветата на пространството на търсене са силно небалансирани
B.	Дърветата на пространството на търсене са големи и трудни за обход
C.	Дърветата на пространството на търсене не могат да се обхождат по много наведнъж
D.	Нито едно от посочените
Answer A

========================
Л8С13
Кое от изброените неща, може да се смята като проблем при дърветата на пространството на търсене?
A.	Желателно е да се обхождат повече на брой поддървета едновременно за да се балансира натоварването на процесите
B.	Дърветата на пространството на търсене са големи и трудни за обход
C.	Дърветата на пространството на търсене не могат да се обхождат по много наведнъж
D.	Нито едно от посочените
Answer A

========================
Л8С14/С15
Какво е изобразено на следните схеми ?
   
A.	Разпределяне на товара
B.	Разцепване на процесите
C.	Размяна на информация между процес 1 и процес2
D.	Нито едно от посочените
Answer A

========================
Л8С16
Какво представлява „разпределено терминиране на паралелната програма“?
A.	Вски процес терминира след като завърши търсенето в разпределената му част от дървото до указаната му дълбочина
B.	Всеки процес работи сам за себе си и не обменя информация с останалите
C.	Всеки процес след терминирането загубва стойността си
D.	Нито едно от посочените
Answer A

========================
Л8С16
Какво е характерно за „разпределеното терминиране на паралелната програма“?
A.	Този тип алгоритми намират всички решения и след това определят оптималното решение
B.	В някои случаи е необходимо само едно решение
C.	Всеки процес работи сам за себе си и не обменя информация с останалите
D.	Всеки процес след терминирането загубва стойността си
Answer: A B

========================
Л8С18
Кое от изброените неща се отнася за алгоритъмът на Дийкстра за разпределено терминиране?
A.	Всеки процес има цвят и брояч на съобщенията
B.	При започване на обработката всеки процес е бял и броячът на съобщението е нулиран
C.	В някои случаи е необходимо само едно решение
D.	Всеки процес работи сам за себе си и не обменя информация с останалите
Answer: A B

========================
Л8С18
Кое от изброените неща се отнася за алгоритъмът на Дийкстра за разпределено терминиране?
A.	Процесът се оцветява в черно, когато изпраща или получава съобщение
B.	При изпращане на съобщение – процесът инкрементира брояча на съобщенията
C.	В някои случаи е необходимо само едно решение
D.	Всеки процес работи сам за себе си и не обменя информация с останалите
Answer: A B

========================
Л8С18
Кое от изброените неща се отнася за алгоритъмът на Дийкстра за разпределено терминиране?
A.	При получаване на съобщение – процесът декрементира брояча на съобщенията
B.	При изпращане на съобщение – процесът инкрементира брояча на съобщенията
C.	В някои случаи е необходимо само едно решение
D.	Всеки процес работи сам за себе си и не обменя информация с останалите
Answer: A B

========================
Л8С19
Кое от изброените неща се отнася за алгоритъмът на Дийкстра за разпределено терминиране?
A.	Ако всички процеси са маркирани в бяло и сумата от броячите на съобщенията на всички процеси е 0 -> процесите могат да бъдат терминирани
B.	Рамковото съобщение (token) има цвят и брояч
C.	В някои случаи е необходимо само едно решение
D.	Всеки процес работи сам за себе си и не обменя информация с останалите
Answer: A B

========================
Л8С19
Кое от изброените неща се отнася за алгоритъмът на Дийкстра за разпределено терминиране?
A.	Когато процес 0 инициира пробата, рамковото съобщение е бяло и броячът му е нулиран
B.	Когато процес получава token, той прибавя стойността на брояча си към тази на брояча на token-а
C.	В някои случаи е необходимо само едно решение
D.	Всеки процес работи сам за себе си и не обменя информация с останалите
Answer: A B

========================
Л8С19
Кое от изброените неща се отнася за алгоритъмът на Дийкстра за разпределено терминиране?
A.	Процесът се оцветява в черно, ако получава съобщение или обработва подпроблем с по-малка стойност на g от тази на текущото най-добро решение
B.	Ако процесът е черен, той оцветява token-а в черно, а самият той става бял и оредава рамковото съобщение към следващият процес в рамките на логическият ранг.
C.	В някои случаи е необходимо само едно решение
D.	Всеки процес работи сам за себе си и не обменя информация с останалите
Answer: A B

========================
Л8С20
Приемането или предаването на рамковото съобщение (token) променя ли съдържанието на броячите на съобщенията на процесите?
A.	Не
B.	Да
Answer: A

========================
Л8С20
След получаването на съобщение за терминиране, какво изпращат всички останали процеси?
A.	MPI_Finalize
B.	MPI_End
C.	MPI_Finalle
D.	Нито едно от посочените
Answer A

========================
Л9С3
Кое от изброените е характерно за Комбинаторното търсене по метода на клоните и границите?
A.	Вид вариант на търсенето с обратен ход
B.	Анализира се информацията за оптималността на частичните решения, като се избягват решенията, които не могат да бъдат оптимални
C.	Вид подразновидност на сортировката на балончето
D.	Нито едно от посоченото
Answer: A B

========================
Л9С4
За какво се използва Пъзелър на Сам Лойд?
A.	За представяне на позициите, които могат да бъдат получени от първоначалното разположение на плочките върху дъската 
B.	За представяне на празните позиции, които ще трябва да бъдат запълнени
C.	За представяне на различни видове сортировки които биха решили даденият казус
D.	Нито едно от посочените
Answer A

========================
Л9С4
Каква е целта на пъзела на Сам Лойд?
A.	Целта е да се разгледат миксимален брой на ходове
B.	Целта е да се разгледат максимален брой на ходове
C.	Целта е да се намери един единствен отговор
D.	Нито едно от посочените
Answer A

========================
Л9С15
Какво е изобразено на схемата?
 
A.	Дърво на търсене за решение на пъзела на Сам Лойд
B.	Крайно решение на пъзела на Сам Лойд
C.	Междинно дърво за намиране на решениена Сам Лойд
D.	Нито едно от посочените
Answer A

========================
Л9С16
Стратегията за търсене определя реда на...
A.	...разглеждане на възлите
B.	...разпределяне на товара на възлите
C.	...намиране на най-оптимално решение
D.	Нито едно от посочените
Answer A

========================
Л9С16
Стратегията „първо най-добрият път“ ибира неразгледаните проблеми с ...
A.	Най-малка долна граница
B.	Най-малка горна граница
C.	Най-голяма лява граница
D.	Най-малка лява граница
Answer A

========================
Л9С18
Целта на търсенето по метода на клоните и границите  да ...
A.	... се намали броят на възлите, които трябва да се разгледат като се използва функция на долната граница, които не могат да доведат до оптимални решения
B.	... се увеличи броят на възлите, които трябва да се разгледат като се използва функция на долната граница
C.	... се намали броят на възлите, които трябва да се разгледат като се използва функция на горната граница
D.	Нито едно от изброените
Answer A

========================
Л9С19
Последователният алгоритъм на паралелното търсене по метода на клоните и границите преполага...
A.	Изграждането на приоритетна опашка за неразгледаните проблеми
B.	Играждането на масив съдържащ разгледани и неразгледани проблеми
C.	Изграждането на списък по който се разглеждат дадени проблеми
D.	Нито едно от изброените
Answer A

========================
Л9С19
Последователният алгоритъм на паралелното търсене по метода на клоните и границите когато става въпрос з амултикомпютърните платформи централизираната приоритетна опашка е ...
A.	Неефективна
B.	Ефективна
C.	Не играе никаква роля
D.	Нито едно от посочените
Answer A

========================
Л9С19
Кое от изброените неща е вярно за паралелното търсене по метода на клоните и границите?
A.	Един процесор осъществява операциите над приоритетната опашка
B.	Една приоритетна опашка не дава възможност за мащабиране
C.	Един процесор работи едновременно над няколко опашки
D.	Нито едно от посочените
Answer: A B

========================
Л9С20
Кое от изброените неща е вярно за паралелното търсене по метода на клоните и границите?
A.	Всеки процесор трябва да поддържа собствена опашка на неразгледаните подпроблеми
B.	През всяка итерация всеки процес премахва от приоритетната си опашка подпроблема с най-малка долна граница
C.	Един процесор работи едновременно над няколко опашки
D.	Нито едно от посочените
Answer: A B

========================
Л9С20
Кое от изброените неща е вярно за паралелното търсене по метода на клоните и границите?
A.	Ако подпроблемът не е възел на решение, то той се разделя на b подпроблема, които се вмъкват в приоритетната му опашка
B.	Не съществува синхронизация между процесите
C.	Един процесор работи едновременно над няколко опашки
D.	Нито едно от посочените
Answer: A B

========================
Л9С21
Кое от изброените неща е вярно за паралелното търсене по метода на клоните и границите?
A.	От време на време даден процес изпраща неразгледани подпроблеми на друг процес
B.	В началото процес 0 съдържа първоначалния си проблем в приоритетната си опашка
C.	Един процесор работи едновременно над няколко опашки
D.	Нито едно от посочените
Answer: A B

========================
Л9С21
Кое от изброените неща е вярно за паралелното търсене по метода на клоните и границите?
A.	Приоритетните опашки на другите процеси са празни и те престояват
B.	Процес 0 разпределя неразгледаните подпроблеми, рекурсивно новите подпроблеми се разпределят и т.н.
C.	Един процесор работи едновременно над няколко опашки
D.	Нито едно от посочените
Answer: A B

========================
Л9С31
Последователният алгоритъм best-first branch-and-bound, при търсене по метода на клоните и границите се основава на използването  на приоритетна опашка и ...
A.	…обхождане на възможния минимален брой възли, при зададена функция на границата g
B.	...обхождане на възможния максимален брой възли, при зададена функция на границата g
C.	...обхождане на възли с най-малки стойности, при зададена функция на границата g
D.	...обхождане на възли с най-големи стойности, при зададена функция на границата g 
Answer A

========================
Л9С31
Последователният алгоритъм best-first branch-and-bound, при търсене по метода на клоните и границите се основава на използването  на приоритетна опашка и обхождане на възможния минимален брой възли, при зададена функция на границата g, тогава винаги ....
A.	...първо се обхожда възела с най-малка стойност на g
B.	...първо се обхожда възела с най-голяма стохнст на g
C.	...първо се обхожда последният възел
D.	...първо се обхожда първият възел
Answer A

========================
Л9С31
Последователният алгоритъм best-first branch-and-bound спира своето изпълнение когато при откриване на решение
A.	По определение не съществъва възел с по-малка стойност на g
B.	По определение има възел с по-голяма стойност на g
C.	По определение има възел със стойност 0
D.	Нито едно от посочените
Answer A

========================
Л9С32
Кое от изброените неща е вярно за паралелният алгоритъм best-first branch-and-bound ?
A.	Възможно е да бъдат обходени възли, водещи до неоптимално решение
B.	Всеки процес обхожда възела, който локално предлага най-доброто решение – възела с минимална стойност на g в локалната приоритетна опашка
C.	През всяка итерация всеки процес премахва от приоритетната си опашка подпроблема с най-малка долна граница
D.	В началото процес 0 съдържа първоначалния си проблем в приоритетната си опашка
Answer: A B

========================
Л9С32
Кое от изброените неща е вярно за паралелният алгоритъм best-first branch-and-bound ?
A.	Паралелния алгоритъм насърчава разпределението на подпроблеми с добри стойности на g между всички процеси като по този начин се намалява обема на излишните изчисления
B.	Динамичното разпределение на товара повишава разходите за комуникация на паралелния алгоритъм
C.	През всяка итерация всеки процес премахва от приоритетната си опашка подпроблема с най-малка долна граница
D.	В началото процес 0 съдържа първоначалния си проблем в приоритетната си опашка
Answer: A B

========================
Л9С33
Кои от изброените по-долу неща са условия за прекратяване на паралелния алгоритъм за търсене по метода на клоните и границите?
A.	Не е намерено решение
B.	Не съществува по-добро решение
C.	Решението е равно на 0
D.	Грешка в програмата
Answer: A B

========================
Л9С33
Колко наброй са условията за прекратяване на паралелния алгоритъм за търсене по метода на клоните и границите?
A.	1
B.	2
C.	3
D.	4
Answer B

========================
Л9С34
С процес с кой ранг се прекратява паралелния алгоритъм за търсене по метода на клоните и границите?
A.	0
B.	1
C.	2
D.	3
Answer A
";

        static string[] questions = Questions2.Split(new[] { "========================" }, StringSplitOptions.None);

        protected void Page_Load(object sender, EventArgs e)
        {            
        }

        protected void Button1_Click(object sender, EventArgs e)
        {
            var matches = questions.Where(q => q.IndexOf(this.Question.Text, StringComparison.InvariantCultureIgnoreCase) >= 0);
            Label1.Text = string.Join("</br>", matches);
        }
    }
}